       IDENTIFICATION DIVISION.
       PROGRAM-ID. INVALIDNAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 A PIC X(10). 
       PROCEDURE DIVISION.
       MOVE 'PAS$' TO A.
       IF A IS ALPHABETIC THEN
           DISPLAY "VALID NAME"
       ELSE 
           DISPLAY "INVALID NAME"
       END-IF.
            STOP RUN.
       END PROGRAM INVALIDNAME.
